---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadType.LightingLoadDensity
source: html/cc763ac8-9800-6ab9-f3e5-9401fa081437.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType.LightingLoadDensity Property

The lighting load density.

## Syntax (C#)
```csharp
public double LightingLoadDensity { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The value should be between [0.0,500000.0].